<template>
    <section class="flex flex-col rounded-xl bg-gradient-to-b from-stone-50 to-stone-100 p-6 shadow-inner">
        <div class="mb-4 flex items-center justify-between">
            <h2 class="text-xl font-semibold text-stone-800">{{ t("playlists")}}</h2>
            <svg class="h-5 w-5 text-stone-500" xmlns="http://www.w3.org/2000/svg" fill="currentColor"
                viewBox="0 0 1024 1024">
                <path fill="currentColor"
                    d="M940.736 189.696C912.992 169.728 835.68 143.2 511.728 143.2c-347.152 0-398.656 30.464-415.185 40.432C8.575 236.479.223 470.447-.544 517.887C.512 580.545 10.64 789.008 96.48 840.577c16.497 9.935 67.712 40.223 415.248 40.223c324.16 0 401.376-26.4 429.008-46.288c74.976-53.935 83.6-239.68 83.808-317.439c-.192-62.528-6.752-271.872-83.807-327.376zm-37.376 592.88c-11.152 8.032-75.186 34.223-391.634 34.223c-305.936 0-370.128-23.744-382.256-31.056c-30.88-18.528-63.472-116.88-66.031-268.032c2.528-150.816 35.568-260.912 66.097-279.216c12.16-7.344 76.591-31.28 382.19-31.28c316.192 0 380.4 26.369 391.633 34.433c27.409 19.744 56.752 123.68 57.184 275.632c-.432 154.336-29.968 245.712-57.184 265.296zM720.415 486.83L432.481 310.141a32 32 0 0 0-32.257-.464a32.02 32.02 0 0 0-16.288 27.872v353.44a32.016 32.016 0 0 0 32 32a32 32 0 0 0 16.527-4.592L720.4 541.645c9.6-5.807 15.472-16.19 15.472-27.407s-5.856-21.632-15.456-27.408zM447.953 634.301V394.204l194 120.032z" />
            </svg>
        </div>
        <ul class="-mr-2 h-48 flex-1 space-y-3 overflow-y-auto pr-2 md:h-auto">
            <li
                class="flex cursor-pointer items-center justify-between rounded-lg bg-white p-3 transition-shadow hover:shadow-sm">
                <div class="flex min-w-0 items-center">
                    <svg xmlns="http://www.w3.org/2000/svg" class="mr-5 h-4 w-4 text-stone-400 flex-shrink-0"
                        viewBox="0 0 1024 1024">
                        <path fill="currentColor"
                            d="M33.76 63.76h448c17.664 0 32-14.336 32-32s-14.336-32-32-32h-448c-17.664 0-32 14.336-32 32s14.32 32 32 32m0 192h448c17.664 0 32-14.336 32-32s-14.336-32-32-32h-448c-17.664 0-32 14.336-32 32s14.32 32 32 32m480 160c0-17.664-14.336-32-32-32h-448c-17.664 0-32 14.336-32 32s14.336 32 32 32h448c17.664 0 32-14.336 32-32m499.12-91.216L699.968 11.646c-9.904-9.92-24.656-11.84-36.592-6.016c-12.544 4.336-21.616 16.113-21.616 30.128v708.4c-33.92-25.135-78.432-40.527-127.376-40.527c-106.064 0-192.097 71.776-192.097 160.288c0 88.528 86.032 160.336 192.097 160.336c106.128 0 192.096-71.808 192.096-160.336c0-4.016-.368-7.936-.72-11.871V107.952L967.6 369.808c12.496 12.496 32.769 12.496 45.265 0s12.496-32.769.015-45.265zM641.76 867.021c-2.304 44.497-54.191 92.815-128.127 92.815c-75.648 0-128.353-50.56-128.353-95.871c0-45.344 52.704-95.84 128.353-95.84c73.936 0 125.823 48.256 128.127 92.784v6.113z" />
                    </svg>
                    <span class="truncate text-sm font-medium text-stone-700">نام پلی لیست ۱</span>
                </div>
                <svg class="ml-1 h-4 w-4 flex-shrink-0 text-stone-400" fill="currentColor" viewBox="0 0 20 20"
                    xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd"
                        d="M7.293 14.707a1 1 0 010-1.414L10.586 10 7.293 6.707a1 1 0 011.414-1.414l4 4a1 1 0 010 1.414l-4 4a1 1 0 01-1.414 0z"
                        clip-rule="evenodd"></path>
                </svg>
            </li>
            <li
                class="flex cursor-pointer items-center justify-between rounded-lg bg-white p-3 transition-shadow hover:shadow-sm">
                <div class="flex min-w-0 items-center">
                    <svg xmlns="http://www.w3.org/2000/svg" class="mr-5 h-4 w-4 flex-shrink-0" viewBox="0 0 1024 1024">
                        <path fill="#000"
                            d="M33.76 63.76h448c17.664 0 32-14.336 32-32s-14.336-32-32-32h-448c-17.664 0-32 14.336-32 32s14.32 32 32 32m0 192h448c17.664 0 32-14.336 32-32s-14.336-32-32-32h-448c-17.664 0-32 14.336-32 32s14.32 32 32 32m480 160c0-17.664-14.336-32-32-32h-448c-17.664 0-32 14.336-32 32s14.336 32 32 32h448c17.664 0 32-14.336 32-32m499.12-91.216L699.968 11.646c-9.904-9.92-24.656-11.84-36.592-6.016c-12.544 4.336-21.616 16.113-21.616 30.128v708.4c-33.92-25.135-78.432-40.527-127.376-40.527c-106.064 0-192.097 71.776-192.097 160.288c0 88.528 86.032 160.336 192.097 160.336c106.128 0 192.096-71.808 192.096-160.336c0-4.016-.368-7.936-.72-11.871V107.952L967.6 369.808c12.496 12.496 32.769 12.496 45.265 0s12.496-32.769.015-45.265zM641.76 867.021c-2.304 44.497-54.191 92.815-128.127 92.815c-75.648 0-128.353-50.56-128.353-95.871c0-45.344 52.704-95.84 128.353-95.84c73.936 0 125.823 48.256 128.127 92.784v6.113z" />
                    </svg>
                    <span class="truncate text-sm font-medium text-stone-700">آموزش‌های Tailwind CSS که نام طولانی‌تری
                        دارد</span>
                </div>
                <svg class="ml-1 h-4 w-4 flex-shrink-0 text-stone-400" fill="currentColor" viewBox="0 0 20 20"
                    xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd"
                        d="M7.293 14.707a1 1 0 010-1.414L10.586 10 7.293 6.707a1 1 0 011.414-1.414l4 4a1 1 0 010 1.414l-4 4a1 1 0 01-1.414 0z"
                        clip-rule="evenodd"></path>
                </svg>
            </li>
        </ul>
        <button
            class="mt-4 w-full rounded-lg bg-stone-800 px-4 py-2.5 text-sm font-medium text-white transition-colors hover:bg-stone-700">+
          {{t("allPlaylist")}}</button>
    </section>
</template>

<script setup>
const {t} = useI18n()
</script>
